<a href="https://colab.research.google.com/github/SihyunPark01/AI_WEB/blob/main/pandas%20/%20%EC%9B%90%ED%95%98%EB%8A%94_%EB%8D%B0%EC%9D%B4%ED%84%B0_%EC%B0%BE%EA%B8%B0_Query_Search.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

path = 'https://raw.githubusercontent.com/blackdew/ml-tensorflow/master/data/csv/lemonade.csv'
df = pd.read_csv(path)

df

   온도  판매량
0  20   40
1  21   42
2  22   44
3  23   46
4  24   48
5  25   50

In [ ]:
(df['온도']>23)

0    False
1    False
2    False
3    False
4     True
5     True
Name: 온도, dtype: bool

In [ ]:
df[(df['온도'] > 23)]   #true에 해당되는 열만 가져올 수 있음

   온도  판매량
4  24   48
5  25   50

In [ ]:
df[(df['온도'] > 23) | (df['판매량'] == 40)]   #or 조건에서 해당하는 열만 가져옴

   온도  판매량
0  20   40
4  24   48
5  25   50

In [ ]:
d = {'col1':['Item0','Item1','Item1','Item1'],
     'col2':['Gold','Bronze','Gold','Silver']}
df1 = pd.DataFrame(d)
df1

    col1    col2
0  Item0    Gold
1  Item1  Bronze
2  Item1    Gold
3  Item1  Silver

In [ ]:
df1.col2.str.contains('o')      #col2의 문자열에 'o'를 포함한 단어가 있는가

0     True
1     True
2     True
3    False
Name: col2, dtype: bool

In [ ]:
df1[df1.col2.str.contains('o')]     #'o'를 포함한 단어가 있는 컬럼만 출력

    col1    col2
0  Item0    Gold
1  Item1  Bronze
2  Item1    Gold

In [ ]:
# Boolean Indexing : 조건문을 통해서 Boolean Series를 만든 다음 []안에 넣으면 True에 해당하는 행만 반환함.

In [ ]:
df = pd.read_csv('https://raw.githubusercontent.com/blackdew/ml-tensorflow/master/data/csv/boston.csv')
df

        crim    zn  indus  chas    nox  ...  tax  ptratio       b  lstat  medv
0    0.00632  18.0   2.31     0  0.538  ...  296     15.3  396.90   4.98  24.0
1    0.02731   0.0   7.07     0  0.469  ...  242     17.8  396.90   9.14  21.6
2    0.02729   0.0   7.07     0  0.469  ...  242     17.8  392.83   4.03  34.7
3    0.03237   0.0   2.18     0  0.458  ...  222     18.7  394.63   2.94  33.4
4    0.06905   0.0   2.18     0  0.458  ...  222     18.7  396.90   5.33  36.2
..       ...   ...    ...   ...    ...  ...  ...      ...     ...    ...   ...
501  0.06263   0.0  11.93     0  0.573  ...  273     21.0  391.99   9.67  22.4
502  0.04527   0.0  11.93     0  0.573  ...  273     21.0  396.90   9.08  20.6
503  0.06076   0.0  11.93     0  0.573  ...  273     21.0  396.90   5.64  23.9
504  0.10959   0.0  11.93     0  0.573  ...  273     21.0  393.45   6.48  22.0
505  0.04741   0.0  11.93     0  0.573  ...  273     21.0  396.90   7.88  11.9

[506 rows x 14 columns]

In [ ]:
df_sorted = df.sort_values(by=['tax'], ascending=False)
df_sorted.head()

        crim   zn  indus  chas    nox  ...  tax  ptratio       b  lstat  medv
492  0.11132  0.0  27.74     0  0.609  ...  711     20.1  396.90  13.35  20.1
491  0.10574  0.0  27.74     0  0.609  ...  711     20.1  390.11  18.07  13.6
490  0.20746  0.0  27.74     0  0.609  ...  711     20.1  318.43  29.68   8.1
489  0.18337  0.0  27.74     0  0.609  ...  711     20.1  344.05  23.97   7.0
488  0.15086  0.0  27.74     0  0.609  ...  711     20.1  395.09  18.06  15.2

[5 rows x 14 columns]